In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
data = pd.read_csv("nba.csv")
data.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [4]:
data.shape

(458, 9)

In [7]:
data.isnull().sum()

Name         1
Team         1
Number       1
Position     1
Age          1
Height       1
Weight       1
College     85
Salary      12
dtype: int64

In [17]:
mode_college = data['College'].mode()
print(mode_college)
#Replacing NA with college mode
data['College'].fillna(mode_college,inplace = True)
data.isnull().sum()

0    Kentucky
Name: College, dtype: object

Name         1
Team         1
Number       1
Position     1
Age          1
Height       1
Weight       1
College     85
Salary      12
dtype: int64

In [9]:
data['Salary'].mean()

4842684.105381166

In [10]:
data['Age'].value_counts()  #Counts the number of people of age

Age
24.0    47
25.0    45
27.0    41
23.0    41
26.0    36
28.0    31
30.0    31
29.0    28
22.0    26
31.0    22
20.0    19
21.0    19
33.0    14
32.0    13
34.0    10
36.0    10
35.0     9
37.0     4
38.0     4
40.0     3
39.0     2
19.0     2
Name: count, dtype: int64

In [13]:
average_salary_by_age = data.groupby('Age')['Salary'].mean()
print(average_salary_by_age)

Age
19.0    1.930440e+06
20.0    2.725791e+06
21.0    2.067380e+06
22.0    2.357963e+06
23.0    2.034746e+06
24.0    3.785300e+06
25.0    3.930867e+06
26.0    6.866566e+06
27.0    6.676741e+06
28.0    5.110189e+06
29.0    6.224177e+06
30.0    7.061859e+06
31.0    8.511397e+06
32.0    7.716958e+06
33.0    3.930739e+06
34.0    7.606030e+06
35.0    3.461740e+06
36.0    2.238120e+06
37.0    1.277778e+07
38.0    1.840041e+06
39.0    2.517872e+06
40.0    4.666917e+06
Name: Salary, dtype: float64

In [18]:
data.dtypes

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

In [4]:
standardDeviation = np.std(data['Age'])
standardDeviation

4.399195386918678

In [5]:
age_sal_std = data.groupby('Age')['Salary'].std()
age_sal_std

Age
19.0    2.791658e+05
20.0    1.510913e+06
21.0    1.412350e+06
22.0    1.517378e+06
23.0    2.728292e+06
24.0    4.803384e+06
25.0    4.558463e+06
26.0    6.100471e+06
27.0    6.831984e+06
28.0    4.316627e+06
29.0    4.870706e+06
30.0    5.408670e+06
31.0    7.170163e+06
32.0    7.451336e+06
33.0    4.354293e+06
34.0    5.653035e+06
35.0    2.364690e+06
36.0    1.550061e+06
37.0    1.071517e+07
38.0    1.496661e+06
39.0    2.220522e+06
40.0    4.155421e+06
Name: Salary, dtype: float64

In [6]:
# Part  2:Assignment 3

In [8]:
df =  pd.read_csv('Iris.csv')
df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            NaN           0.2  Iris-setosa

In [10]:
df.shape

(150, 6)

In [11]:
df.describe()

               Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  150.000000     150.000000    150.000000     149.000000    150.000000
mean    75.500000       5.843333      3.054000       3.774497      1.198667
std     43.445368       0.828066      0.433594       1.759651      0.763161
min      1.000000       4.300000      2.000000       1.000000      0.100000
25%     38.250000       5.100000      2.800000       1.600000      0.300000
50%     75.500000       5.800000      3.000000       4.400000      1.300000
75%    112.750000       6.400000      3.300000       5.100000      1.800000
max    150.000000       7.900000      4.400000       6.900000      2.500000

In [12]:
df.dtypes

Id                 int64
SepalLengthCm    float64
SepalWidthCm     float64
PetalLengthCm    float64
PetalWidthCm     float64
Species           object
dtype: object

In [14]:
df.isnull().sum()

Id               0
SepalLengthCm    0
SepalWidthCm     0
PetalLengthCm    1
PetalWidthCm     0
Species          0
dtype: int64

In [15]:
# Count of each species
species_counts = df["Species"].value_counts()
print(species_counts)

Species
Iris-setosa        50
Iris-versicolor    50
Iris-virginica     50
Name: count, dtype: int64

In [16]:
def species_statistics(dataframe):
    species_list = dataframe["Species"].unique()
    
    for species in species_list:
        print(f"\nStatistics for {species}:\n")
        
        stats = (
            dataframe[dataframe["Species"] == species]
            .drop(columns=["Species"])
            .describe()
            .transpose()
        )
        
        print(stats)

# Call the function
species_statistics(df)

Statistics for Iris-setosa:

               count       mean        std  min     25%   50%     75%   max
Id              50.0  25.500000  14.577380  1.0  13.250  25.5  37.750  50.0
SepalLengthCm   50.0   5.006000   0.352490  4.3   4.800   5.0   5.200   5.8
SepalWidthCm    50.0   3.418000   0.381024  2.3   3.125   3.4   3.675   4.4
PetalLengthCm   49.0   1.465306   0.175061  1.0   1.400   1.5   1.600   1.9
PetalWidthCm    50.0   0.244000   0.107210  0.1   0.200   0.2   0.300   0.6

Statistics for Iris-versicolor:

               count    mean        std   min     25%    50%    75%    max
Id              50.0  75.500  14.577380  51.0  63.250  75.50  87.75  100.0
SepalLengthCm   50.0   5.936   0.516171   4.9   5.600   5.90   6.30    7.0
SepalWidthCm    50.0   2.770   0.313798   2.0   2.525   2.80   3.00    3.4
PetalLengthCm   50.0   4.260   0.469911   3.0   4.000   4.35   4.60    5.1
PetalWidthCm    50.0   1.326   0.197753   1.0   1.200   1.30   1.50    1.8

Statistics for Iris-virginica:

               count     mean        std    min      25%     50%      75%  \
Id              50.0  125.500  14.577380  101.0  113.250  125.50  137.750
SepalLengthCm   50.0    6.588   0.635880    4.9    6.225    6.50    6.900
SepalWidthCm    50.0    2.974   0.322497    2.2    2.800    3.00    3.175
PetalLengthCm   50.0    5.552   0.551895    4.5    5.100    5.55    5.875
PetalWidthCm    50.0    2.026   0.274650    1.4    1.800    2.00    2.300

                 max
Id             150.0
SepalLengthCm    7.9
SepalWidthCm     3.8
PetalLengthCm    6.9
PetalWidthCm     2.5